# Subqueries in Select Reading

### Introduction

### Loading our Data

In [50]:
telecom_df = pd.read_csv('./telecom_companies.csv')

In [53]:
import sqlite3
conn = sqlite3.connect('telecom.db')

In [54]:
companies_df.to_sql('companies', conn)

In [55]:
cursor = conn.cursor()

In [60]:
pd.read_sql('SELECT * FROM companies LIMIT 2;',conn)

   index company_name  market_cap  stock_price
0      0      Comcast      276.76        60.30
1      1      Verizon      226.96        54.82

### Comparing vs Total

Now let's say that we want to add a new column that indicates how much each company deviates from the average market capitalization.  As a first step, let's add a new column called `avg_market_cap` that simply indicates the average market cap across the entire dataset.  

So far the main way we know how to calculate the average marget cap is like so.

In [62]:
pd.read_sql('SELECT AVG(market_cap) as avg_market_cap FROM companies;',conn)

   avg_market_cap
0         27.3403

But this of course will does not return the rest of our columns.  And if we attempt to include these, we will still just get back a single row.

In [65]:
pd.read_sql("""SELECT market_cap, 
            AVG(market_cap) as avg_market_cap FROM companies;""" ,conn)

   market_cap  avg_market_cap
0      276.76         27.3403

Not exactly what we want.  Ok, so to solve this, we can use a subquery.  Let's see this and then we'll break it down.

In [76]:
sql = """SELECT company_name, market_cap, 
(SELECT AVG(market_cap) as avg_market_cap FROM companies)
as avg_market_cap FROM companies"""

pd.read_sql(sql, conn)[:3]

  company_name  market_cap  avg_market_cap
0      Comcast      276.76         27.3403
1      Verizon      226.96         27.3403
2         AT&T      195.77         27.3403

And this is what the query looks like with some nice sql highlighting.

```sql 
SELECT company_name, market_cap,

(SELECT AVG(market_cap) as avg_market_cap FROM companies) as avg_market_cap

FROM companies
```

So notice that without the subquery, we have a normal sql statement

```sql
SELECT company_name, market_cap FROM companies
```

And then to add in our column from the subquery, we again use a normal select statement but wrap it in parentheses, and then specify how to reference it with the `as` keyword.
```sql
(SELECT AVG(market_cap) as avg_market_cap FROM companies) as avg_market_cap
```

The subquery above returns a single column

### Resources

[Subqueries in Select](https://www.essentialsql.com/get-ready-to-learn-sql-server-20-using-subqueries-in-the-select-statement/)

[Correlated Subqueries](https://stackoverflow.com/questions/18909388/using-partition-clause-in-the-subquery)

[Multiple Columns in Subquery](https://stackoverflow.com/questions/583954/how-can-i-select-multiple-columns-from-a-subquery-in-sql-server-that-should-ha)